<?php

return [

    'required' => 'هذا الحقل مطلوب',

    'email' => 'صيغة البريد الإلكتروني غير صحيحة',
    'unique' => ' هذا الحقل مستخدم من قبل.',
    
    'confirmed' => 'تأكيد الباسورد غير صحيح',
    'regex' => 'رجاء إدخال الخقل بشكل صحيح',
   
    'exists' => 'هذا الحقل غير موجود.',
    'in' => 'هذا الحقل المحدد غير صالح.',
   'different' => 'يجب أن يكون هذا الحقل مختلف عن الاخرون',
   'uuid' => ': يجب ادخال الرقم السرى',
 
   'error'=>'غير مسموح لك بادخال هذا الحقل',

    'custom' => [
        'price' => [
        'decimal' => 'يجب أن يكون الحد الأدنى للسعر رقم عشري بدقتين',
        'required' => 'السعر يجب أن يكون بين الحد الأدنى والحد الأقصى',
    ],

    'visit_type_en' => [
        'string' => 'نوع الزيارة بالإنجليزية يجب أن يكون نص',
        'max' => 'نوع الزيارة بالإنجليزية يجب ألا يتجاوز 255 حرف',
        'unique'=>'الاسم الانجليزى موجود ',
    ],
    'visit_type_ar' => [
        'string' => 'نوع الزيارة بالعربية يجب أن يكون نص',
        'max' => 'نوع الزيارة بالعربية يجب ألا يتجاوز 255 حرف',
         'unique'=>'الاسم العربى موجود ',
    ],
    'min_price' => [
        'decimal' => 'يجب أن يكون الحد الأدنى للسعر رقم عشري بدقتين',
        'min' => 'الحد الأدنى للسعر يجب أن يكون على الأقل 0',
    ],
    'max_price' => [
        'decimal' => 'يجب أن يكون الحد الأقصى للسعر رقم عشري بدقتين',
        'gt' => 'يجب أن يكون الحد الأقصى للسعر أكبر من الحد الأدنى',
    ],


     'image_ar' => [
        'unique' => 'الصورة العربية مستخدمة قبل ذلك',
        'mimes' => 'png,jpg,jpeg يجب أن تكون الصورة العربية نوع',
        'max' => 'يجب ألا تتجاوز الصورة العربية 2 ميجا',
    ],
    'image_en' => [
        'unique' => 'الصورة الانجليزية مستخدمة قبل ذلك',
        'mimes' => 'png,jpg,jpeg يجب أن تكون الصورة الانجليزية نوع',
        'max' => 'يجب ألا تتجاوز الصورة الانجليزية 2 ميجا',
    ],


    'description_en' => [
        'required' => 'الوصف العربى مطلوب',
        'unique' => 'هذا الوصف العربى موجود بالفعل',
    ],
    'description_ar' => [
        'required' => 'الوصف الانجليزى مطلوب',
        'unique' => 'هذا الوصف الانجليزى موجود بالفعل',
    ],
       
       
        'surgery_type'=>[
             'required'=>'نوع العملية مطلوب',
             'string'=>'نوع العملية يجب ان يكون نص',
        ],
        'user_id'=>[
           'required'=>'المستخدم مطلوب',
             'exists'=>'المستخدم غير موجود',
        ],

       'jobtitle'=>[
            'required'=>'المسمى الوظيفى مطلوب',
            'max' => 'اسم الوظيفة لا يتعدى 255 حرف',
            'unique' => 'عنوان الوظيفة موجود بالفعل.',
        ],

        'organization'=>[
            'required'=>'اسم المؤسسة مطلوب',
            'max' => 'اسم المؤسسة لا يزيد عن 255 حرف',
            'unique' => 'اسم المؤسسة موجود بالفعل.',
        ],
        'current'=>[
             'required'=>'العمل الحالى مطلوب',
             'boolean'=>'العمل الحالى يكتب اما 0 او 1',
        ],


       'name_en' => [
        'required' => 'الاسم الإنجليزي مطلوب.',
        'unique' => 'الاسم الإنجليزي موجود بالفعل.',
    ],
    'name_ar' => [
        'required' => 'الاسم العربي مطلوب.',
        'unique' => 'الاسم العربي موجود بالفعل.',
    ],

        'name' => [
            'min' => ' الاسم يجب أن لا يقل عن 3 أحرف',
            'max' => ' الاسم يجب ألا يتجاوز 255 حرفً',
        ],
        'password' => [
            'min' => ' كلمة المرور يجب أن لا تقل عن 6 أحرف',
        ],
        'email' => [
            'email' => 'يرجى إدخال بريد إلكتروني صحيح',
            'unique' => 'هذا البريد الإلكتروني مستخدم بالفعل',
        ],
        'new_password' => [
            'min' => 'كلمة المرور الجديدة يجب أن لا تقل عن 6 أحرف',
        ],
        'current_password' => [
            'min' => 'كلمة المرور الجديدة يجب أن لا تقل عن 6 أحرف',
        ],
        'image' => [
            'mimes' => 'يجب أن تكون الصورة من نوع: png أو jpg أو jpeg',
            'max' => 'يجب ألا يتجاوز حجم الصورة 2 ميغابايت',
        ],
        'mobile' => [
            'regex' => 'رقم الهاتف غير صالح، يجب أن يبدأ بـ 010 أو 011 أو 012 أو 015 ويكون 11 رقمًا',
            'unique' => 'رقم الهاتف مستخدم بالفعل',
        ],
        'department_id' => [
            'required' => 'القسم مطلوب عند اختيار نوع المستخدم كـ طبيب',
            'exists' => 'القسم المحدد غير موجود',
        ],
        'user_type' => [
            'in' => 'نوع المستخدم غير صالح',
        ],

        'usage' => [
        'in' => '"verify" أو "forget"نوع الاستخدام يجب أن يكون إما ',
    ],
    'current_password' => [
        'min' => 'كلمة المرور الحالية يجب أن لا تقل عن 6 أحرف.',
    ],

    'new_password' => [
        'min' => 'كلمة المرور الجديدة يجب أن لا تقل عن 6 أحرف.',
        'different' => 'كلمة المرور الجديدة يجب أن تكون مختلفة عن كلمة المرور الحالية.',
         'confirmed' => 'تأكيد كلمة المرور الجديدة غير متطابق.',
    ],
    'old_password' => [
            'min' => 'كلمة المرور القديمة يجب أن لا تقل عن 6 أحرف.',
        ],

      'otp' => [
          'digits' => 'رمز التحقق يجب أن يتكون من 4 أرقام',
    ],

    'uuid' => [
        'uuid' => 'صيغة الرقم الفريد غير صحيحة',
        'exists' => 'الرقم الفريد لهذا المستخدم غير موجود',
    ],

    ],

    'attributes' => [
        'email' => 'البريد الإلكتروني',
        'name' => 'الاسم',
        'password' => 'كلمة المرور',
        'mobile' => 'رقم الهاتف',
        'image' => 'الصورة',
        'department_id' => 'القسم',
        'user_type' => 'نوع المستخدم',
        'usage'=>' نوع الاستخدام',
        'current_password'=>'الباسورد الحالى',
        'otp' => 'رمز التحقق',
        'old_password' => 'كلمة المرور القديمة',
        'new_password' => 'كلمة المرور الجديدة',
        'uuid'=>'الرقم الفريد',
        'name_en',
        'name_ar',
        'jobtitle',
        'organization',
        'current',
        'surgery_type',
        'user_id',
       'description_en',
       'description_ar',
       'image_en',
       'image_ar',
       'visit_type_ar',
        'visit_type_en',
        'min_price',
        'max_price',
        'price',
       
    ],
];
