<?php

return [

    'required' => 'هذا الحقل مطلوب',

    'email' => 'صيغة البريد الإلكتروني غير صحيحة',
    'unique' => ' هذا الحقل مستخدم من قبل.',
    
    'confirmed' => 'تأكيد الباسورد غير صحيح',
    'regex' => 'رجاء إدخال الخقل بشكل صحيح',
   
    'exists' => 'هذا الحقل غير موجود.',
    'in' => 'هذا الحقل المحدد غير صالح.',
   'different' => 'يجب أن يكون هذا الحقل مختلف عن الاخرون',
   'uuid' => ': يجب ادخال الرقم السرى',

    'custom' => [
        'name' => [
            'min' => ' الاسم يجب أن لا يقل عن 3 أحرف',
            'max' => ' الاسم يجب ألا يتجاوز 255 حرفً',
        ],
        'password' => [
            'min' => ' كلمة المرور يجب أن لا تقل عن 6 أحرف',
        ],
        'email' => [
            'email' => 'يرجى إدخال بريد إلكتروني صحيح',
            'unique' => 'هذا البريد الإلكتروني مستخدم بالفعل',
        ],
        'new_password' => [
            'min' => 'كلمة المرور الجديدة يجب أن لا تقل عن 6 أحرف',
        ],
        'current_password' => [
            'min' => 'كلمة المرور الجديدة يجب أن لا تقل عن 6 أحرف',
        ],
        'image' => [
            'mimes' => 'يجب أن تكون الصورة من نوع: png أو jpg أو jpeg',
            'max' => 'يجب ألا يتجاوز حجم الصورة 2 ميغابايت',
        ],
        'mobile' => [
            'regex' => 'رقم الهاتف غير صالح، يجب أن يبدأ بـ 010 أو 011 أو 012 أو 015 ويكون 11 رقمًا',
            'unique' => 'رقم الهاتف مستخدم بالفعل',
        ],
        'department_id' => [
            'required' => 'القسم مطلوب عند اختيار نوع المستخدم كـ طبيب',
            'exists' => 'القسم المحدد غير موجود',
        ],
        'user_type' => [
            'in' => 'نوع المستخدم غير صالح',
        ],

        'usage' => [
        'in' => '"verify" أو "forget"نوع الاستخدام يجب أن يكون إما ',
    ],
    'current_password' => [
        'min' => 'كلمة المرور الحالية يجب أن لا تقل عن 6 أحرف.',
    ],

    'new_password' => [
        'min' => 'كلمة المرور الجديدة يجب أن لا تقل عن 6 أحرف.',
        'different' => 'كلمة المرور الجديدة يجب أن تكون مختلفة عن كلمة المرور الحالية.',
         'confirmed' => 'تأكيد كلمة المرور الجديدة غير متطابق.',
    ],
    'old_password' => [
            'min' => 'كلمة المرور القديمة يجب أن لا تقل عن 6 أحرف.',
        ],

      'otp' => [
          'digits' => 'رمز التحقق يجب أن يتكون من 4 أرقام',
    ],

    'uuid' => [
        'uuid' => 'صيغة الرقم الفريد غير صحيحة',
        'exists' => 'الرقم الفريد لهذا المستخدم غير موجود',
    ],

    ],

    'attributes' => [
        'email' => 'البريد الإلكتروني',
        'name' => 'الاسم',
        'password' => 'كلمة المرور',
        'mobile' => 'رقم الهاتف',
        'image' => 'الصورة',
        'department_id' => 'القسم',
        'user_type' => 'نوع المستخدم',
        'usage'=>' نوع الاستخدام',
        'current_password'=>'الباسورد الحالى',
        'otp' => 'رمز التحقق',
       'old_password' => 'كلمة المرور القديمة',
       'new_password' => 'كلمة المرور الجديدة',
       'uuid'=>'الرقم الفريد',
    ],
];
